Revit 2024 API
View.IsInTemporaryViewMode Method
 Returns true if the view is in a particular temporary view mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsInTemporaryViewMode(
	TemporaryViewMode mode
)
Visual Basic
Public Function IsInTemporaryViewMode ( _
	mode As TemporaryViewMode _
) As Boolean
Visual C++
public:
bool IsInTemporaryViewMode(
	TemporaryViewMode mode
)
Parameters
mode
Type: Autodesk.Revit.DB.TemporaryViewMode
 The mode.
Return Value
 True if this view is in the temporary view mode indicated, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
View Class
Autodesk.Revit.DB Namespace